using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace OOPPractice
{
    class Computer
    {
        // за ПК может сесть школьник (кто то) (место, слот)
        // количество минут за компьютером, сколько их осталось
        // у каждого пк есть своя цена за минуту времени
        // компьютер занят в данный момент или свободен?
        
        //действия
        // за компьютер можно сесть.
        // компьютер можно освободить.

        // каждый школьник занимает пк на определенное количество
        // минут

        // конструктор?
        

        // отчет времени за пк по минутам..

        // отображение информации о пк, занят,
        // свободен сколько времени осталось

    }
}
