namespace Task9
{
    class Program
    {
        static void Main(string[] args)
        {
            // Массивы
            //     Работа с конкретными строками\столбцами
            //     Дан двумерный массив.
            //     Вычислить сумму второй строки и произведение первого столбца.
            //      Вывести исходную матрицу и результаты вычислений.
            int[,] myArray =
            {
                {1, 3, 4, 5, 6, 7}, 
                {1, 3, 4, 5, 6, 7},
                {1, 3, 4, 5, 6, 7}
            };


        }
    }
}